In [1]:
import pandas as pd

### Basics

In [2]:
medal_board = {
    'USA':     {'Gold': 46, 'Silver': 37, 'Bronze': 38},
    'China':   {'Gold': 26, 'Silver': 18, 'Bronze': 26},
    'UK':      {'Gold': 27, 'Silver': 23, 'Bronze': 17},
    'Russia':  {'Gold': 19, 'Silver': 18, 'Bronze': 19},
    'Germany': {'Gold': 17, 'Silver': 10, 'Bronze': 15}
}

In [3]:
medal_board_df = pd.DataFrame.from_dict(medal_board)

In [4]:
medal_board_df

        USA  China  UK  Russia  Germany
Gold     46     26  27      19       17
Silver   37     18  23      18       10
Bronze   38     26  17      19       15

In [5]:
medal_board_df['UK']

Gold      27
Silver    23
Bronze    17
Name: UK, dtype: int64

In [6]:
medal_board_df.UK

Gold      27
Silver    23
Bronze    17
Name: UK, dtype: int64

In [7]:
medal_board_df.get('UK')

Gold      27
Silver    23
Bronze    17
Name: UK, dtype: int64

In [8]:
medal_board_df[['USA', 'China', 'UK']]

        USA  China  UK
Gold     46     26  27
Silver   37     18  23
Bronze   38     26  17

In [9]:
medal_board_df.iloc[0]

USA        46
China      26
UK         27
Russia     19
Germany    17
Name: Gold, dtype: int64

### Slicing

In [10]:
medal_board_df

        USA  China  UK  Russia  Germany
Gold     46     26  27      19       17
Silver   37     18  23      18       10
Bronze   38     26  17      19       15

In [11]:
medal_board_df[:1]

      USA  China  UK  Russia  Germany
Gold   46     26  27      19       17

In [12]:
medal_board_df[1:]

        USA  China  UK  Russia  Germany
Silver   37     18  23      18       10
Bronze   38     26  17      19       15

In [13]:
medal_board_df[::-1]

        USA  China  UK  Russia  Germany
Bronze   38     26  17      19       15
Silver   37     18  23      18       10
Gold     46     26  27      19       17

### Slicing by Index Names

In [14]:
medal_board_df

        USA  China  UK  Russia  Germany
Gold     46     26  27      19       17
Silver   37     18  23      18       10
Bronze   38     26  17      19       15

In [15]:
medal_board_df.loc['Gold']

USA        46
China      26
UK         27
Russia     19
Germany    17
Name: Gold, dtype: int64

In [16]:
medal_board_df.loc['Silver']['UK']
# Or: medal_board_df.loc['Silver', 'UK']

23

In [17]:
medal_board_df.loc['Gold'] > 25

USA         True
China       True
UK          True
Russia     False
Germany    False
Name: Gold, dtype: bool

In [18]:
medal_board_df.loc[:, medal_board_df.loc['Gold'] < 20]

        Russia  Germany
Gold        19       17
Silver      18       10
Bronze      19       15

### Slicing by Index Numbers

In [19]:
medal_board_df

        USA  China  UK  Russia  Germany
Gold     46     26  27      19       17
Silver   37     18  23      18       10
Bronze   38     26  17      19       15

In [20]:
medal_board_df.iloc[:1]

      USA  China  UK  Russia  Germany
Gold   46     26  27      19       17

In [21]:
medal_board_df.iloc[0, 0:3]

USA      46
China    26
UK       27
Name: Gold, dtype: int64

In [22]:
medal_board_df.iloc[2:3, :]

        USA  China  UK  Russia  Germany
Bronze   38     26  17      19       15

In [23]:
medal_board_df.iloc[2, 0]

38

### Removing Elements

In [24]:
medal_board_df

        USA  China  UK  Russia  Germany
Gold     46     26  27      19       17
Silver   37     18  23      18       10
Bronze   38     26  17      19       15

In [25]:
del medal_board_df['Germany']

In [26]:
medal_board_df

        USA  China  UK  Russia
Gold     46     26  27      19
Silver   37     18  23      18
Bronze   38     26  17      19

### Adding Elements

In [27]:
medal_board_df

        USA  China  UK  Russia
Gold     46     26  27      19
Silver   37     18  23      18
Bronze   38     26  17      19

In [28]:
medal_board_df.insert(4, 'Brazil', (18, 12, 20))

In [29]:
medal_board_df

        USA  China  UK  Russia  Brazil
Gold     46     26  27      19      18
Silver   37     18  23      18      12
Bronze   38     26  17      19      20